### 서비스 이탈 예측 데이터

데이터 설명 : 고객의 신상정보 데이터를 통한 회사 서비스 이탈 예측 (종속변수 : Exited) <br>
x_train : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_train.csv <br>
y_train : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_train.csv <br> 
x_test : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_test.csv <br> 
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_test.csv <br>
데이터 출처 : https://www.kaggle.com/shubh0799/churn-modelling 에서 변형

In [25]:
import pandas as pd

x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_train.csv")
x_test = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_test.csv")

print(x_train.shape)
print(y_train.shape)
print(x_test.shape)

(6499, 12)
(6499, 2)
(3501, 12)

### 데이터 탐색

In [26]:
x_train.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,15799217,Zetticci,791,Germany,Female,35,7,52436.20,1,1,0,161051.75
1,15748986,Bischof,705,Germany,Male,42,8,166685.92,2,1,1,55313.51
2,15722004,Hsiung,543,France,Female,31,4,138317.94,1,0,0,61843.73
3,15780966,Pritchard,709,France,Female,32,2,0.00,2,0,0,109681.29
4,15636731,Ts'ai,714,Germany,Female,36,1,101609.01,2,1,1,447.73

In [27]:
x_test.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,15601012,Abdullah,802,France,Female,60,3,92887.06,1,1,0,39473.63
1,15734762,Ignatiev,602,France,Female,56,3,115895.22,3,1,0,4176.17
2,15586757,Anenechukwu,801,France,Female,32,4,75170.54,1,1,1,37898.50
3,15590888,Wade,693,Spain,Female,34,10,107556.06,2,0,0,154631.35
4,15726087,Ch'in,592,France,Female,62,5,0.00,1,1,1,100941.57

In [28]:
y_train.head()

   CustomerId  Exited
0    15799217       0
1    15748986       0
2    15722004       0
3    15780966       0
4    15636731       0

In [29]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6499 entries, 0 to 6498
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       6499 non-null   int64
 1   Surname          6499 non-null   object
 2   CreditScore      6499 non-null   int64
 3   Geography        6499 non-null   object
 4   Gender           6499 non-null   object
 5   Age              6499 non-null   int64
 6   Tenure           6499 non-null   int64
 7   Balance          6499 non-null   float64
 8   NumOfProducts    6499 non-null   int64
 9   HasCrCard        6499 non-null   int64
 10  IsActiveMember   6499 non-null   int64
 11  EstimatedSalary  6499 non-null   float64
dtypes: float64(2), int64(7), object(3)
memory usage: 609.4+ KB

In [30]:
y_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6499 entries, 0 to 6498
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerId  6499 non-null   int64
 1   Exited      6499 non-null   int64
dtypes: int64(2)
memory usage: 101.7 KB

In [31]:
x_train.isnull().sum()

CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
Balance            0
NumOfProducts      0
HasCrCard          0
IsActiveMember     0
EstimatedSalary    0
dtype: int64

In [32]:
y_train.isnull().sum()

CustomerId    0
Exited        0
dtype: int64

In [33]:
x_train.describe()

,CustomerId,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
count,6.499000e+03,6499.000000,6499.000000,6499.000000,6499.000000,6499.000000,6499.000000,6499.000000,6499.000000
mean,1.569157e+07,650.396830,38.957070,5.041545,76836.581068,1.519772,0.708878,0.514387,100346.564524
std,7.187584e+04,96.618957,10.502803,2.891779,62407.570894,0.578975,0.454314,0.499831,57944.655305
min,1.556570e+07,350.000000,18.000000,0.000000,0.000000,1.000000,0.000000,0.000000,11.580000
25%,1.562949e+07,584.000000,32.000000,3.000000,0.000000,1.000000,0.000000,0.000000,50907.565000
50%,1.569181e+07,651.000000,37.000000,5.000000,97560.160000,1.000000,1.000000,1.000000,100496.840000
75%,1.575358e+07,718.000000,44.000000,8.000000,127844.690000,2.000000,1.000000,1.000000,150480.155000
max,1.581566e+07,850.000000,92.000000,10.000000,238387.560000,4.000000,1.000000,1.000000,199970.740000

In [34]:
x_train['Geography'].value_counts()

France     3227
Germany    1650
Spain      1622
Name: Geography, dtype: int64

In [35]:
x_train['Gender'].value_counts()

Male      3485
Female    2861
 male       80
female      73
Name: Gender, dtype: int64

In [36]:
x_train['Surname'].value_counts()

Brown         21
Scott         20
Shih          20
Martin        19
Smith         19
              ..
Steiner        1
Descoteaux     1
Sozonov        1
Jefferson      1
Gilleland      1
Name: Surname, Length: 2289, dtype: int64

In [37]:
x_test['Gender'].value_counts()

Male      1839
Female    1562
 male       53
female      47
Name: Gender, dtype: int64

### 정규화

In [38]:
# Gender 통일

x_train.loc[x_train['Gender'] == ' male', 'Gender'] = 'Male'
x_train.loc[x_train['Gender'] == 'female', 'Gender'] = 'Female'

In [39]:
x_train['Gender'].value_counts()

Male      3565
Female    2934
Name: Gender, dtype: int64

In [40]:
x_test.loc[x_test['Gender'] == ' male', 'Gender'] = 'Male'
x_test.loc[x_test['Gender'] == 'female', 'Gender'] = 'Female'

In [41]:
x_test['Gender'].value_counts()

Male      1892
Female    1609
Name: Gender, dtype: int64

In [43]:
x_train.drop('CustomerId', inplace=True, axis=1)
x_train.drop('Surname', inplace=True, axis=1)
x_train.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,791,Germany,Female,35,7,52436.20,1,1,0,161051.75
1,705,Germany,Male,42,8,166685.92,2,1,1,55313.51
2,543,France,Female,31,4,138317.94,1,0,0,61843.73
3,709,France,Female,32,2,0.00,2,0,0,109681.29
4,714,Germany,Female,36,1,101609.01,2,1,1,447.73

In [44]:
x_test.drop('CustomerId', inplace=True, axis=1)
x_test.drop('Surname', inplace=True, axis=1)
x_test.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,802,France,Female,60,3,92887.06,1,1,0,39473.63
1,602,France,Female,56,3,115895.22,3,1,0,4176.17
2,801,France,Female,32,4,75170.54,1,1,1,37898.50
3,693,Spain,Female,34,10,107556.06,2,0,0,154631.35
4,592,France,Female,62,5,0.00,1,1,1,100941.57

## 데이터 전처리

In [46]:
x_train_dummies = pd.get_dummies(x_train)
x_test_dummies = pd.get_dummies(x_test)
x_test_dummies = x_test_dummies[x_train_dummies.columns]
y = y_train['Exited']

In [47]:
from sklearn.model_selection import train_test_split

x_train, x_valid, y_train, y_valid = train_test_split(x_train_dummies, y)

### 모델링(Random Forest)

In [48]:
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()
rf.fit(x_train, y_train)

RandomForestClassifier()

In [49]:
predict_train = rf.predict(x_train)
predict_val = rf.predict(x_valid)

In [50]:
from sklearn.metrics import roc_auc_score

print("AUROC: ", roc_auc_score(y_valid, predict_val))

AUROC:  0.7041263399622534